app/Controllers/Admin.php

SELECT `announcements`.*, `users`.`name` as `posted_by`
FROM `announcements`
JOIN `users` ON `users`.`id` = `announcements`.`user_id`
ORDER BY `announcements`.`created_at` DESC
SELECT `courses`.`title` AS `course_title`, `instructors`.`name` AS `instructor_name`, `students`.`name` AS `student_name`, `enrollments`.`enrollment_date`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
JOIN `users` AS `instructors` ON `instructors`.`id` = `courses`.`instructor_id`
JOIN `users` AS `students` ON `students`.`id` = `enrollments`.`user_id`
ORDER BY `enrollments`.`enrollment_date` DESC
SELECT `courses`.`id`, `courses`.`title`, `courses`.`description`, `users`.`name` as `instructor_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
ORDER BY `courses`.`title` ASC
---
    public function dashboard()
    {
        $session = session();
        $db = db_connect();

        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/auth/login');
        }

        $user_id   = $session->get('user_id');
        $user_role = $session->get('role');
        $user_name = $session->get('user_name');

        // Fetch announcements with poster info
        $data['announcements'] = $db->table('announcements')
            ->select('announcements.*, users.name as posted_by')
            ->join('users', 'users.id = announcements.user_id')
            ->orderBy('announcements.created_at', 'DESC')
            ->get()
            ->getResultArray();

        // Fetch all enrollments
        $data['allEnrollments'] = $db->table('enrollments')
            ->select('courses.title AS course_title,
                      instructors.name AS instructor_name,
                      students.name AS student_name,
                      enrollments.enrollment_date')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->join('users AS instructors', 'instructors.id = courses.instructor_id')
            ->join('users AS students', 'students.id = enrollments.user_id')
            ->orderBy('enrollments.enrollment_date', 'DESC')
            ->get()
            ->getResultArray();

        // Fetch all courses for materials management
        $data['courses'] = $db->table('courses')
            ->select('courses.id, courses.title, courses.description, users.name as instructor_name')
            ->join('users', 'users.id = courses.instructor_id')
            ->orderBy('courses.title', 'ASC')
            ->get()
            ->getResultArray();