app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'
 LIMIT 1
---
    public function login()
    {
        if (session()->get('logged_in')) {
            return redirect()->to('/course/dashboard');
        }

        if ($this->request->getMethod() === 'GET') {
            return view('auth/login');
        }

        if ($this->request->getMethod() === 'POST') {
            if (!$this->validate([
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[6]'
            ])) {
                return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
            }

            $userModel = new UserModel();
            $email     = $this->request->getPost('email');
            $password  = $this->request->getPost('password');
            $user      = $userModel->where('email', $email)->first();

SELECT *
FROM `notifications`
WHERE `user_id` = '5'
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '5'
AND `is_read` = 0
SELECT `id`, `title`, `description`
FROM `courses`
SELECT `courses`.`id`, `courses`.`title`, `courses`.`description`, `enrollments`.`enrollment_date`
FROM `enrollments`
JOIN `courses` ON `enrollments`.`course_id` = `courses`.`id`
WHERE `enrollments`.`user_id` = '5'
---
    public function dashboard()
    {
        $session = session();

        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $db = \Config\Database::connect();
        $userId   = $session->get('user_id');
        $userRole = strtolower($session->get('role'));
        $userName = $session->get('user_name');

        // ✅ Fetch notifications
        $notifications = $db->table('notifications')
                          ->where('user_id', $userId)
                          ->orderBy('created_at', 'DESC')
                          ->limit(10)
                          ->get()
                          ->getResultArray();

        // ✅ Count unread notifications
        $unreadCount = $db->table('notifications')
                         ->where('user_id', $userId)
                         ->where('is_read', 0)
                         ->countAllResults();

        // ✅ Fetch all courses
        $courses = $db->table('courses')
                      ->select('id, title, description')
                      ->get()
                      ->getResultArray();

        // ✅ Fetch enrolled courses
        $enrolledCourses = $db->table('enrollments')
            ->select('courses.id, courses.title, courses.description, enrollments.enrollment_date')
            ->join('courses', 'enrollments.course_id = courses.id')
            ->where('enrollments.user_id', $userId)
            ->get()
            ->getResultArray();

SELECT `announcements`.*, `users`.`name` as `posted_by`
FROM `announcements`
JOIN `users` ON `users`.`id` = `announcements`.`user_id`
ORDER BY `announcements`.`created_at` DESC
---
        }

        // ✅ Fetch announcements for all roles
        $announcements = $db->table('announcements')
            ->select('announcements.*, users.name as posted_by')
            ->join('users', 'users.id = announcements.user_id')
            ->orderBy('announcements.created_at', 'DESC')
            ->get()
            ->getResultArray();