app/Controllers/Auth.php

   public function dashboard()
{
    $session = session();

    if (!$session->get('logged_in')) {
        return redirect()->to('/auth/login')->with('error', 'Please login first.');
    }

    $db        = \Config\Database::connect();
    $userModel = new UserModel();

    $userId   = $session->get('user_id');
    $userRole = strtolower($session->get('user_role'));
    $user     = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'