app/Controllers/Course.php

    public function enroll()
    {
        $session = session();
        $db = db_connect();

        if (!$session->get('isLoggedIn')) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'You must be logged in to enroll.'
            ]);
        }

        $user_id = $session->get('user_id');
        $course_id = $this->request->getPost('course_id');

        if (empty($course_id)) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'No course selected.'
            ]);
        }

        $enrollmentModel = new EnrollmentModel();
        $exists = $enrollmentModel->where('user_id', $user_id)
                                  ->where('course_id', $course_id)
                                  ->first();
---
SELECT *
FROM `enrollments`
WHERE `user_id` = '7'
AND `course_id` = '28'
 LIMIT 1

            $db->transStart();

            // Insert enrollment
            $enrollmentId = $enrollmentModel->insert($data);
---
INSERT INTO `enrollments` (`user_id`, `course_id`, `enrollment_date`) VALUES ('7', '28', '2025-10-24 10:50:13')

    public function search()
    {
        $session = session();
        $db = db_connect();

        if (!$session->get('isLoggedIn')) {
            if ($this->request->isAJAX()) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'You must be logged in to search courses.'
                ]);
            }
            return redirect()->to('/auth/login');
        }

        $searchTerm = $this->request->getVar('search') ?? '';
        $searchTerm = trim($searchTerm);

        // Build the query
        $query = $db->table('courses');

        // Apply search filter if search term is provided
        if (!empty($searchTerm)) {
            $query->like('title', $searchTerm)
                  ->orLike('description', $searchTerm);
        }

        // Execute the query
        $results = $query->get()->getResultArray();
---
SELECT *
FROM `courses`
WHERE `title` LIKE '%Artific%' ESCAPE '!'
OR  `description` LIKE '%Artific%' ESCAPE '!'

        // Get enrolled courses for comparison
        $enrolledCourses = [];
        if ($user_role === 'student') {
            $enrolledCourses = $db->table('enrollments')
                ->select('course_id')
                ->where('user_id', $user_id)
                ->get()
                ->getResultArray();
---
SELECT `course_id`
FROM `enrollments`
WHERE `user_id` = '3'

        }

        // Get user's notifications
        $notifications = $db->table('notifications')
                          ->where('user_id', $user_id)
                          ->orderBy('created_at', 'DESC')
                          ->limit(10)
                          ->get()
                          ->getResultArray();

        // Count unread notifications
        $unreadCount = $db->table('notifications')
                         ->where('user_id', $user_id)
                         ->where('is_read', 0)
                         ->countAllResults();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '3'
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '3'
AND `is_read` = 0