app/Controllers/Materials.php

    public function upload($courseId)
    {
        // Check if user is logged in and is admin or teacher
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $userRole = strtolower($session->get('role'));
        if (!in_array($userRole, ['admin', 'teacher'])) {
            return redirect()->back()->with('error', 'You do not have permission to upload materials.');
        }

        // GET request - Display upload form
        if ($this->request->getMethod() === 'GET') {
            $db = \Config\Database::connect();
            $course = $db->table('courses')->where('id', $courseId)->get()->getRowArray();
---
SELECT *
FROM `courses`
WHERE `id` = '26'