app/Controllers/Notifications.php

SELECT *
FROM `notifications`
WHERE `id` = '39'
AND `user_id` = '5'
 LIMIT 1
---
    public function mark_as_read($id = null)
    {
        if (!session()->get('isLoggedIn')) {
            log_message('warning', 'Unauthorized mark_as_read attempt');
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Not authenticated'
            ]);
        }

        if (empty($id)) {
            log_message('warning', 'mark_as_read called with empty ID');
            return $this->response->setJSON([
                'success' => false,
                'message' => 'No notification ID provided'
            ]);
        }

        $userId = session()->get('user_id');

        log_message('debug', "Marking notification {$id} as read for user {$userId}");

        // Verify the notification belongs to this user
        $notification = $this->notificationModel->where('id', $id)->where('user_id', $userId)->first();

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '5'
AND `is_read` = 0
---
    public function get_unread_count()
    {
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Not authenticated'
            ]);
        }

        $userId = session()->get('user_id');
        $unreadCount = $this->notificationModel->where('user_id', $userId)
                                             ->where('is_read', 0)
                                             ->countAllResults();