app/Models/AnnouncementModel.php

SELECT `announcements`.*, `users`.`name` as `posted_by`, `users`.`role`
FROM `announcements`
JOIN `users` ON `users`.`id` = `announcements`.`user_id`
ORDER BY `announcements`.`created_at` DESC
---
    public function getAnnouncementsWithUser()
    {
        return $this->select('announcements.*, users.name as posted_by, users.role')
                    ->join('users', 'users.id = announcements.user_id')
                    ->orderBy('announcements.created_at', 'DESC')
                    ->findAll();