app/Models/MaterialModel.php

    public function getMaterialsByEnrolledCourses($userId)
    {
        return $this->select('materials.*, courses.title as course_title')
                    ->join('courses', 'courses.id = materials.course_id')
                    ->join('enrollments', 'enrollments.course_id = courses.id')
                    ->where('enrollments.user_id', $userId)
                    ->orderBy('materials.created_at', 'DESC')
                    ->findAll();
---
SELECT `materials`.*, `courses`.`title` as `course_title`
FROM `materials`
JOIN `courses` ON `courses`.`id` = `materials`.`course_id`
JOIN `enrollments` ON `enrollments`.`course_id` = `courses`.`id`
WHERE `enrollments`.`user_id` = '5'
ORDER BY `materials`.`created_at` DESC