app/Models/NotificationModel.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '5'
AND `is_read` = 0
---
    public function getUnreadCount($userId)
    {
        return $this->where([
            'user_id' => $userId,
            'is_read' => 0
        ])->countAllResults();

SELECT *
FROM `notifications`
WHERE `user_id` = '5'
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getNotificationsForUser($userId, $limit = 5)
    {
        return $this->where('user_id', $userId)
                   ->orderBy('created_at', 'DESC')
                   ->findAll($limit);

UPDATE `notifications` SET `is_read` = 1, `updated_at` = '2025-11-26 07:44:30'
WHERE `id` = '39'
AND `user_id` = '5'
---
    public function markAsRead($notificationId, $userId)
    {
        try {
            $result = $this->where('id', $notificationId)
                          ->where('user_id', $userId)
                          ->set('is_read', 1)
                          ->update();